import { facts } from "Components/types";

export const array1: Array<facts> = [{
    year: 2015,
    id: 20151,
    fact: "15 июля NASA продемонстрировало первые изображения карликовой планеты."
},
{
    year: 2015,
    id: 20152,
    fact: "Зонд New Horizons сделал первые фотографии Плутона."
},
{
    year: 2016,
    id: 20163,
    fact: "Учёные обнаружили светящуюся акулу длиной всего 14 см — Etmopterus benchleyi."
},
{
    year: 2016,
    id: 20164,
    fact: "Cоздан искусственный кровяной сосуд, который успешно использовался для пересадки."
},
{
    year: 2017,
    id: 20175,
    fact: "Инженеры разработали съедобную упаковку для продуктов, сделанную из молочного белка."
},
{
    year: 2018,
    id: 20186,
    fact: "Биологи открыли, что муравьи могут строить сложные живые мосты из своих тел."
}]

export const array2: Array<facts> = [{
    year: 2018,
    id: 20181,
    fact: "Популяция африканских слонов начала восстанавливаться благодаря усиленной борьбе с браконьерством."
},
{
    year: 2018,
    id: 20182,
    fact: "Учёные обнаружили ранее неизвестный орган в человеческом теле — интерстициум, который может быть важен для диагностики рака."
},
{
    year: 2019,
    id: 20193,
    fact: "Создан первый в мире биоразлагаемый пластик, который растворяется в воде за 24 часа."
},
{
    year: 2019,
    id: 20194,
    fact: "Учёные описали 71 новый вид животных, включая цветных кораллов и жуков."
},
{
    year: 2020,
    id: 20205,
    fact: "Учёные обнаружили крупнейший коралловый риф за последние 120 лет у берегов Австралии."
},
{
    year: 2020,
    id: 20206,
    fact: "Тысячи онлайн-курсов стали бесплатными, позволяя людям учиться из дома."
}]

export const array3: Array<facts> = [{
    year: 2020,
    id: 20201,
    fact: "В Южной Африке начали выпускать 3D-печатные панцири для черепах, которые потеряли свою защиту."
},
{
    year: 2020,
    id: 20202,
    fact: "Из-за снижения активности человека начали восстанавливаться экосистемы в океанах и на суше."
},
{
    year: 2020,
    id: 20203,
    fact: "Впервые обнаружена планета в другой галактике."
},
{
    year: 2021,
    id: 20214,
    fact: "В Мексике туристы наслаждались редким явлением — светящимися волнами, вызванными морскими организмами."
},
{
    year: 2021,
    id: 20215,
    fact: "Учёные создали устройство, которое превращает загрязнённый воздух в кислород и энергию."
},
{
    year: 2021,
    id: 20216,
    fact: "В Австралии спасли более 20 000 коал, пострадавших от пожаров, с помощью роботов и дронов."
}]

export const array4: Array<facts> = [{
    year: 2021,
    id: 20211,
    fact: "Телескоп Hubble передал самые чёткие изображения далёких галактик."
},
{
    year: 2021,
    id: 20212,
    fact: "Генетики вылечили наследственную слепоту с помощью генной терапии."
},
{
    year: 2022,
    id: 20223,
    fact: "Популяция диких тигров в мире увеличилась до 3 900, что стало результатом усилий по охране."
},
{
    year: 2022,
    id: 20224,
    fact: "Учёные вырастили съедобный шоколадный гриб, который может заменить мясо."
},
{
    year: 2022,
    id: 20225,
    fact: "Впервые зарегистрирована акула, прожившая более 500 лет."
},
{
    year: 2022,
    id: 20226,
    fact: "NASA анонсировала планы по созданию базы на Луне для будущих экспедиций."
}]